{
  "adjust_lmk_pos": true,
  "architectures": [
    "HSAForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 100257,
  "chunk_size": 64,
  "dtype": "bfloat16",
  "enable_lmk_q_proj": true,
  "enable_softmax1": true,
  "eos_token_id": 100257,
  "full_attn_interleave": 1,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "hsa_heads": 8,
  "hsa_mode": "sparse",
  "hsa_qk_ratio": 4,
  "hsa_topk": 32,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "layer_types": [
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention"
  ],
  "max_position_embeddings": 131072,
  "max_window_layers": 32,
  "model_type": "flash_hsa",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 32,
  "num_swa_layers": 16,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 500000.0,
  "sliding_window": 512,
  "tie_word_embeddings": true,
  "transformers_version": "4.57.3",
  "use_cache": true,
  "use_sliding_window": true,
  "vocab_size": 100278
}
