{
  "architectures": [
    "Qwen3ForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 100257,
  "eos_token_id": 100257,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "max_position_embeddings": 131072,
  "max_window_layers": 16,
  "model_type": "qwen3",
  "head_dim": 128,
  "num_attention_heads": 16,
  "num_hidden_layers": 16,
  "num_key_value_heads": 2,
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000.0,
  "sliding_window": null,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.1",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 100278,
  "_attn_implementation": "flash_attention_3",
  "groupwise_topk": false,
  "enable_inrange_rope": true,
  "rope_context_length": 8192,
  "rope_period_multiplier": 2.0
}