{
    "architectures": [
      "HSAForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 100257,
    "eos_token_id": 100257,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "initializer_range": 0.02,
    "intermediate_size": 5632,
    "max_position_embeddings": 131072,
    "max_window_layers": 22,
    "model_type": "qwen_lhsa",
    "head_dim": 64,
    "num_attention_heads": 32,
    "hsa_heads": 32,
    "hsa_qk_ratio": 8,
    "num_hidden_layers": 22,
    "num_key_value_heads": 4,
    "rms_norm_eps": 1e-05,
    "rope_theta": 100000000.0,
    "sliding_window": 512,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.40.1",
    "use_cache": true,
    "use_sliding_window": true,
    "vocab_size": 100278,
    "full_attn_interleave": 1,
    "chunk_size": 64,
    "hsa_topk": 16,
    "_attn_implementation": "flash_attention_3",
    "adjust_lmk_pos": true,
    "enable_lmk_q_proj": true,
    "hsa_sliding_window": 512,
    "unified_retrieval": false,
    "retrieval_head_num": 32,
    "pope_dim": 32,
    "hsa_disturb_prob": 0.5,
    "hsa_dropout_prob": 0.1,
    "groupwise_topk": false,
    "use_pope": true,
    "pope_impl": "fused"
}
