{
  "architectures": ["HSAForCausalLM"],
  "model_type": "olmo_lhsa",

  "attention_bias": false,
  "attention_dropout": 0.0,
  "eos_token_id": 100257,
  "pad_token_id": 100277,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 8192,
  "num_attention_heads": 32,
  "num_key_value_heads": 32,
  "num_hidden_layers": 32,
  "rms_norm_eps": 1e-6,
  "rope_scaling": null,
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "use_cache": true,
  "vocab_size": 100278,

  "use_sliding_window": true,
  "sliding_window": 512,
  "layer_types": [
    "sliding_attention", "sliding_attention", "sliding_attention", "full_attention",
    "sliding_attention", "sliding_attention", "sliding_attention", "full_attention",
    "sliding_attention", "sliding_attention", "sliding_attention", "full_attention",
    "sliding_attention", "sliding_attention", "sliding_attention", "full_attention",
    "sliding_attention", "sliding_attention", "sliding_attention", "full_attention",
    "sliding_attention", "sliding_attention", "sliding_attention", "full_attention",
    "sliding_attention", "sliding_attention", "sliding_attention", "full_attention",
    "sliding_attention", "sliding_attention", "sliding_attention", "full_attention"
  ],

  "replace_full_attention_with_lhsa": false,
  "full_attn_interleave": 4,
  "num_swa_layers": 0,

  "insert_landmarks": false,
  "adjust_lmk_pos": false,
  "auto_insert_lmk": false,
  "enable_external_lmk_embed": true,
  "mask_lmk_token": false,
  "enable_prior_query": false,

  "chunk_size": 64,
  "hsa_heads": 32,
  "hsa_qk_ratio": 1,
  "hsa_topk": 32,
  "hsa_mode": "sparse",

  "apply_hsa_rope": true,
  "enable_lmk_q_proj": true,
  "layerwise_qk_norm": true,
  "enable_softmax1": false,

  "hsa_dropout_prob": 0.0,
  "hsa_disturb_prob": 0.0,
  "enable_gumbel_noise": false,
  "unified_retrieval": false,
  "retrieval_head_num": 32,
  "groupwise_topk": false,

  "_attn_implementation": "sdpa"
}
